code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаПериодическихВыписокПоСчетуДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаПериодическихВыписокПоСчетуДЕПО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выписка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийПакетВФШ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТехническаяОперация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОтправкаПериодическихВыписокПоСчетуДЕПО/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.НаДату) Тогда
		Объект.НаДату = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьВсе(Команда)
	УстановитьЗначениеВсехПометок(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	УстановитьЗначениеВсехПометок(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоручения(Команда)
	Если ДатаКорректна() Тогда
		НайтиПорученияНаСервере();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьВыпискиПоПомеченнымПоручениям(Команда)
	СоздатьВыпискиПоПомеченнымПоручениямНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПомеченные(Команда)
	ОтправитьПомеченныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВходящиеПакетыФайловогоШлюза(Команда)
	РегламентныеЗаданияСервер.ОбработкаВходящихПакетовФайловогоШлюза();
	НайтиПорученияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СостоянияДокументовВФайловомШлюзе(Команда)
	ОткрытьФорму("РегистрСведений.СостоянияДокументовВФайловомШлюзе.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКвитанцииОДоставке(Команда)
	ЗаданияДляАвтообработки.ЗагрузкаКД();
	НайтиПорученияНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	Объект.Поручения.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПорученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Поручения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ПорученияПоручение И ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Поручение);
	ИначеЕсли Поле = Элементы.ПорученияСчетДепо И ЗначениеЗаполнено(ТекущиеДанные.СчетДепо) Тогда
		ПоказатьЗначение(, ТекущиеДанные.СчетДепо);
	ИначеЕсли Поле = Элементы.ПорученияВыписка И ЗначениеЗаполнено(ТекущиеДанные.Выписка) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Выписка);
	ИначеЕсли Поле = Элементы.ПорученияИсходящийПакетВФШ И ЗначениеЗаполнено(ТекущиеДанные.ИсходящийПакетВФШ) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ИсходящийПакетВФШ);
	ИначеЕсли Поле = Элементы.ПорученияТехническаяОперация И ЗначениеЗаполнено(ТекущиеДанные.ТехническаяОперация) Тогда
		ПоказатьЗначение(, ТекущиеДанные.ТехническаяОперация);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ДатаКорректна()
	Если Не ЗначениеЗаполнено(Объект.НаДату) Тогда
		Текст = "Не указано на какую дату нужно сформировать выписки о состоянии счета ДЕПО!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		ДатаКорректна = Ложь;
	ИначеЕсли Не ОбщегоНазначения.РабочийДень(Объект.НаДату) Тогда
		Текст = "Указанная дата не является рабочим днем!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		ДатаКорректна = Ложь;
	Иначе
		ДатаКорректна = Истина;
	КонецЕсли;
	
	Возврат ДатаКорректна;
КонецФункции

&НаСервере
Процедура НайтиПорученияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.НайтиПоручения(Объект.НаДату);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура СоздатьВыпискиПоПомеченнымПоручениямНаСервере()
	ЕстьПомеченные = Ложь;
	Для Каждого СтрокаТЧ Из Объект.Поручения Цикл
		Если СтрокаТЧ.Пометка Тогда
			ЕстьПомеченные = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьПомеченные Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.СоздатьВыписки(Объект.НаДату);
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Иначе
		Текст = "Нет ни одного помеченного поручения!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПомеченныеНаСервере()
	ЕстьПомеченные = Ложь;
	Для Каждого СтрокаТЧ Из Объект.Поручения Цикл
		Если СтрокаТЧ.Пометка И ЗначениеЗаполнено(СтрокаТЧ.Выписка) Тогда
			ЕстьПомеченные = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьПомеченные Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.СформироватьИОтправитьОтчеты(Объект.НаДату);
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Иначе
		Текст = "Нет ни одного помеченного поручения со сформированной выпиской!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеВсехПометок(Значение)
	Для каждого СтрокаТЧ Из Объект.Поручения Цикл
		СтрокаТЧ.Пометка = Значение;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
